
### Terraform Status default

#### Terraform Format and Style 🖌 `failure`
#### Terraform Validate 📖 `success`
#### Terraform Plan 📖 `success`
<details>
<summary>Show Plan</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.dynamo_db.aws_dynamodb_table.api-db["cocktail-recipes"] will be created
  + resource "aws_dynamodb_table" "api-db" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "name"
      + id               = (known after apply)
      + name             = "cocktail-recipes"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "app"   = "fruit-project-foundations"
          + "env"   = "dev"
          + "stack" = "fruit-project"
        }
      + tags_all         = {
          + "app"   = "fruit-project-foundations"
          + "env"   = "dev"
          + "stack" = "fruit-project"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "name"
          + type = "S"
        }
    }

  # module.dynamo_db.aws_dynamodb_table.api-db["food-recipes"] will be created
  + resource "aws_dynamodb_table" "api-db" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "name"
      + id               = (known after apply)
      + name             = "food-recipes"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "app"   = "fruit-project-foundations"
          + "env"   = "dev"
          + "stack" = "fruit-project"
        }
      + tags_all         = {
          + "app"   = "fruit-project-foundations"
          + "env"   = "dev"
          + "stack" = "fruit-project"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "name"
          + type = "S"
        }
    }

  # module.dynamo_db.aws_dynamodb_table.api-db["fruit"] will be created
  + resource "aws_dynamodb_table" "api-db" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "name"
      + id               = (known after apply)
      + name             = "fruit"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "app"   = "fruit-project-foundations"
          + "env"   = "dev"
          + "stack" = "fruit-project"
        }
      + tags_all         = {
          + "app"   = "fruit-project-foundations"
          + "env"   = "dev"
          + "stack" = "fruit-project"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "name"
          + type = "S"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>


Pusher: @Kremzeeq
Action: `pull_request`
